{
  "step-0": "Intro",
  "step-1": "➀ Backup your secret phrases",
  "step-2": "➁ Use a watch-only wallet",
  "step-3": "➂ Use an offline signer",
  "step-4": "Maintenance",
  "net-label": "Detect network connections",
  "net-tip": "Wether the app will verify network is indeed disconnected before executing security sensitive functions",
  "req-disconnect": "please disconnect from the Internet first",
  "alert-1": "the PGP passphrase is not strong enough, please try again",
  "alert-2": "the Bitcoin passphrase is not strong enough, please try again",
  "alert-3": "This will overwrite {{recFile}}. Are you sure?",
  "alert-4": "encrypted PGP file created successfully",
  "alert-5": "Bitcoin secret phrases successfully decrypted from PGP file",
  "alert-6": "fail to obtain secret phrases from the PGP file",
  "sign-1": "signed transaction written to",
  "sign-2": "transaction signed! use your watch-only wallet to scan the QR code, or save it in a file for import",
  "sign-3": "Enter passphrase to unlock the PGP file",
  "sign-4": "Paste PSBT (partially-signed bitcoin transaction) from a watch-only wallet",
  "sign-5": "Reset",
  "sign-6": "Sign Transaction",
  "sign-7": "Save as Transaction File",
  "sign-8": "Save as Binary PSBT File",
  "sign-9": "This is a text version of the above QR code. Copy-paste this into wallets that can accept signed transactions from clipboard",
  "sign-10": "If QR scan fails, use this to save the code above for import into Bluewallet",
  "sign-11": "This is for wallets that only support PSBT file import/export",
  "unlock-1": "PGP file decrypted successfully",
  "unlock-2": "Unlock access to your PGP file",
  "unlock-3": "It looks like you skip the first step and go straight to this one. First please make sure that:",
  "unlock-4": "You have completed the recovery phrase backup steps before.",
  "unlock-5": "The backup PGP file exist in",
  "unlock-6": "You're disconnected from the Internet.",
  "unlock-7": "Next enter the PGP passphrase below to unlock your Bitcoin secret phrases",
  "unlock-8": "Unlock PGP file"
}
