{
  "title": "Practice moving coins using an offline signer",
  "p-0-1": "Secure self-custody entails reducing the number of places that have access to your private keys, so that there's less attack surface that you have to worry about. And since the private keys can always be regenerated of your secret phrases, ideally you want to have just one secure location for those private keys.",
  "p-0-2": "An <1>Offline signer</1> is a network disconnected device designed to provide secured access to your Bitcoin private keys. The lack of Internet connectivity reduces the security risk exposure that this type of system has over the alternative.",
  "p-0-3": "Offline signer communicates with your watch-only wallet through physical space (using QR scan or storage card) to sign transactions initiated from the wallet. This setup is also commonly refered to as <1>cold wallet</1>, and often involve the use of dedicated hardware for the signing device.",
  "p-0-4": "Next we'll explore how to use a software-based offline signer to transfer coins from Bluewallet to your centralised exchange account.",
  "h-1": "Get a Bitcoin deposit address for the exchange",
  "p-1-1": "Use the provider's support system to find out how to deposit BTC to your account through the Bitcoin Mainnet network. Copy the deposit address obtained here for the next step.",
  "h-2": "Initiate a send transaction in Bluewallet",
  "p-2-1": "Try initiating a send transaction from your watch-only wallet to the exchange's deposit address. Since a watch-only wallet doesn't have access to your private key, Bluewallet will provide several options on how to sign the incomplete transaction using an offline signer.",
  "h-3": "Transfer the incomplete transaction to the offline signer",
  "p-3-1": "For now just use \"Copy to clipboard\" option in Bluewallet, and send the encoded incomplete transaction text to your computer through WhatsApp web, or any other means of communication. In a permanently offline signer scenario, this transfer will have to be done over QR code (which requires a camera on the signer) or physical storage like USB flash drive.",
  "p-3-2": "Paste the encoded text below, disconnect your computer from the network to simulate an offline signer, and click on the sign button.",
  "h-4": "Complete the transaction in Bluewallet",
  "p-4-1": "The above QR code contains a signed and finalised transaction. Scan that code in Bluewallet, or import the saved file, and confirm that you want to send/broadcast it to the Bitcoin network. Your balance on the exchange should increase in few minutes after that.",
  "p-4-2": "Notice how you can repeat the steps above to securely transfer coins from Bluewallet watch-only wallet to any other Bitcoin addresses. If your phone gets hacked or confiscated, your funds will be safe since Bluewallet alone cannot be used to complete any transaction. In any case, you can easily regain access to your funds by installing Bluewallet in another device and reimporting the watch-only (public) key as described in the previous step.",
  "h-5": "Evaluate, obtain, and setup an offline signer",
  "p-5-1": "Now that you understand the purpose of an offline signer (or cold wallet) and how it works, you can start evaluating your options for future use. Common categories include:",
  "p-5-2": "Hardware wallet",
  "p-5-3": "Open source Bitcoin-only product like <1>Coldcard</1> is the best for this. Supporting just one crypto means more focus, less complexity, and implies that the team cares more about security than market share. Despite of being Bitcoin-only, Coldcard can securely derive and store many recovery phrases (those 12/24 words) that you can then use for other wallets, including non-Bitcoin crypto wallet.",
  "p-5-4": "Sofware wallet (on a computer)",
  "p-5-5": "These are typically wallets with many features that are difficult to setup as a secure offline signer without sufficient technical expertise.",
  "p-5-6": "If this is your only option for now, it's maybe better to use Shiro as a simple temporary offline signer until you settle on a more permanent solution. To run Shiro in dedicated offline signing mode, open the terminal and supply <1>--signer</1> as startup parameter, for example on Windows:",
  "p-5-7": "There's also a desktop version of Bluewallet that's worth trying if you're on a Mac operating system.",
  "p-5-8": "Sofware wallet (on a dedicated mobile phone)",
  "p-5-9": "This is a good alternative if you have a spare unused mobile phone to repurpose as a dedicated cold wallet. You just need to reset the device, install a cold wallet app like <1>AirGap Vault</1>, supply your recovery phrase and passphrase to it, and disconnect the device from the network. Make sure to also setup a boot password, lock-screen, and other available physical security measures.",
  "p-5-10": "Whichever solution you end up using, try to stick only to the non-proprietary features (like basic offline signing) so that you can easily move to other system if necessary. Be extra cautious of products that require you to use their web app, or have extra functionalities that are not available in well-known open source systems."
}
