{
  "title": "Backup your <1></1> secret phrases",
  "p-0-1": "Setting up a Bitcoin wallet requires a <1>recovery phrase</1>, and optionally a <3>passphrase</3>. Wallet uses those two to derive private and public key pairs, each of whom control access to a specific Bitcoin address.",
  "p-0-2": "A good Bitcoin wallet will use a different address, hence different key pair, for each new transaction. But since those keys are all derivable from the source recovery phrase and passphrase, a good self-custody setup only needs to make sure that those two secrets are always available/accessible.",
  "p-0-3": "It is however, critical to understand that <1>if you lose either of those two secrets, then nothing can help you recover your coins</1>. For that reason, here we will first focus on safeguarding your recovery phrase and passphrase, without having to rely on a dedicated hardware/software or subscribe to a 3rd party services.",
  "h-1": "Download and install GnuPG for your operating system",
  "p-1-1": "We will use GnuPG to put your recovery phrase in an encrypted file, so that it can safely be stored in the cloud.",
  "p-1-2": "It is important to use a mature encryption protocol that has wide software support for long term protection. PGP (Pretty Good Privacy) is such protocol, and GnuPG is a well-known open source implementation of it. GnuPG latest version is available for download from <1>here</1>.",
  "h-2": "Use a (relatively) safe and clean system",
  "p-2-1": "Disconnect all network connections, and run a full anti-malware scan. Make sure to proceed only on a clean system. Do <1>not</1> reconnect to any network until instructed to later on.",
  "h-3": "Generate Bitcoin secret phrases",
  "p-3-1": "Enter existing 12/24 words recovery phrase or generate a new one using the button below. It is <1>highly recommended</1> to generate a new one here if you doubt whether you've securely handled the old recovery phrase.",
  "p-3-2": "Reasons for concern include if the old one had been copied/saved in various places, or if one of those storage is not encrypted, if the phrase had been installed into various wallet apps that are not open source, or if you've created the old wallet without supplying a passphrase. In those cases it's better to start a new and just transfer existing coins to the new wallet.",
  "p-3-2-1": "Enter recovery phrase or click generate ...",
  "p-3-2-2": "Generate Bitcoin Recovery Phrase",
  "p-3-2-3": "Next, enter or generate a passphrase to pair with the recovery phrase. Note that you <strong>can not change this</strong> later on, and you will need to type this in every time you sign a Bitcoin transaction. For practical reason, this passphrase should then only be around 10-15 characters long, and should be easy to type and eventually remember.",
  "p-3-2-4": "Enter passphrase or click generate ...",
  "p-3-2-5": "Generate Bitcoin passphrase",
  "h-4": "Backup the secret phrases into an encrypted PGP file",
  "p-4-1": "Next we'll put those secret phrases inside an encrypted backup PGP file, so they can safely be stored in multiple places. Enter or generate the passphrase to lock/unlock the backup PGP file below. You will not have to unlock this backup file frequently and will only ever do so in a secure computer, so a stronger passphrase (than the previous Bitcoin passphrase) is recommended here.",
  "p-4-1-1": "Enter strong passphrase or click the button to generate ...",
  "p-4-1-2": "Generate PGP Passphrase",
  "p-4-2": "Use the button below to create the PGP backup file (<1>recovery.txt.gpg</1>) inside your home directory.",
  "p-4-2-1": "<1>WARNING</1>: this will overwrite the existing file at",
  "p-4-2-2": "Backup Bitcoin Secret Phrases",
  "h-5": "Verify that the backup is working correctly",
  "p-5-1": "This next button will try to programatically use the PGP passphrase to unlock and read the Bitcoin secret phrases from the encrypted file.",
  "p-5-1-1": "Verify Decryption",
  "p-5-2": "Now learn how to decrypt the PGP file (<1>recovery.txt.gpg</1>) by yourself using GnuPG software. Use the button below to locate the file, and open it with GnuPG desktop app (Kleopatra) and the PGP passphrase. Verify that there is a recovery.txt inside it, and that it contains the Bitcoin secret phrases separated by",
  "p-5-2-1": "Locate PGP File",
  "h-6": "Backup the PGP passphrase",
  "p-6-1": "Write down the PGP passphrase on at least 2 sheets of paper. Do not add extra info/note to them so others will not know what the phrases are for. Store those papers in a different secure location. If you use a password manager software, store the passphrase there as well (again, without adding contextual info).",
  "p-6-2": "It is worth noting that the format of a Bitcoin recovery phrases is well known, i.e. there's 12/24 words, and each word comes from a predefined 2048 word list. It is therefore not a good idea to have them written on paper (or steel plate for that matter) and stored in a supposedly secure physical location.",
  "p-6-3": "In contrast, the backup PGP passphrase doesn't have to follow specific convention and can then be written on paper and stored in a safe location, provided that there's no clue given about its intended use. This is arguably one of those cases where security through obscurity can be justified.",
  "p-6-4": "Confirm that you have written down the PGP passphrase and/or have insert it into your password manager by clicking the following button. This will erase all phrases from the input fields above.",
  "p-6-4-1": "Confirm backup of the PGP passphrase",
  "h-7": "Store the PGP file in multiple locations",
  "p-7-1": "Connect back to the Internet. Copy the <1>recovery.txt.gpg</1> file to two or more reputable cloud storage providers (e.g. Google drive, Microsoft OneDrive, Apple iCloud Drive, Dropbox, etc.). Make sure to enable multi-factors authentication for your account on each of them.",
  "p-7-2": "Copy the PGP file into one or two USB flash drives as well. Those act as a backup to your cloud storage, and should be stored on a different location from the written passphrase."
}
