{
  "title": "Move coins to watch-only wallet",
  "p-0-1": "This step guides you on how to transfer coins from your centralised exchange (CEX) account like Binance, ByBit, Crypto.com and others, to a self-custodial <1>watch-only</1> wallet in your mobile device. A watch-only wallet doesn't have access to your recovery phrase and passphrase, and therefore cannot generate the private keys needed to sign transactions by itself.",
  "h-1": "Install Bluewallet app from <1>Apple Appstore</1> or <3>Google Playstore</3>",
  "p-1-1": "Bluewallet is an open-source Bitcoin-only app that supports watch-only wallet mode. It also supports a lot of advanced features without relying on specific company proprietary service, so you can expand your Bitcoin use later on without the risk of being locked-in on a specific platform.",
  "h-2": "Add a watch-only wallet",
  "p-2-1": "Open the app and add a new watch-only wallet by copy-pasting or QR-scanning the following extended public key. This key is associated with a private key generated out of your secret phrases from previous section.",
  "p-2-2": "Note that although this is a public key, it is still better not to disclose it to others for privacy reason. Anyone who has access to this key will be able derive all of the Bitcoin addresses associated with your wallet, and can therefore see all of your past and future transactions.",
  "p-2-2-1": "Hide",
  "p-2-2-2": "Show",
  "h-3": "Register a Bitcoin address as withdrawal destination on the CEX",
  "p-3-1": "Navigate to your watch-only wallet and generate a receiving address from it. The address should starts with <strong>bc1</strong>. As an example, the first address generated in Bluewallet for you should be:",
  "p-3-2": "Next in your centralised exchange account, register that address as your Bitcoin (BTC) withdrawal address on the Bitcoin (Segwit) network. Consult the exchange support system if you need help on how to do this.",
  "p-3-3": "Be aware that for privacy reasons, reusing Bitcoin receiving addresses is considered to be a bad practice. Bluewallet for instance, will automatically propose a new address after the previous one has been used to receive coins.",
  "p-3-4": "In this case however, the trade-off of being able to whitelist a specific address for withdrawal on your CEX maybe worth the exception. If in the future your CEX account is compromised, the intruder will not be able to immediately withdraw funds to an address under their control. The CEX will force them to first whitelist that new address, in which case you will likely be alerted of that attempt.",
  "h-4": "Transfer coins from CEX to the watch-only wallet",
  "p-4-1": "Now test transfering coins from the exchange to your new self-custody wallet. Withdraw a small amount of first, like 0.0001 BTC or less. Typically your balance in Bluewallet will be updated in just a few minutes.",
  "p-4-2": "If everything goes well, you should now be able to send larger amount using the same procedure without issues.",
  "p-4-3": "Rest assured that with good practices as adviced here, over long period of time your coins will be much more safe and accessible in self-custody rather than on the exchange. As a general rule, you should only keep the amount of coins that you want to trade in the near future on the exchange.",
  "h-5": "Activate extra security features on the watch-only wallet",
  "p-5-1": "These refer to optional privacy features that are disabled by default. For Bluewallet, consider activating the following defense-in-depth options for better protection:",
  "p-5-1-1": "Biometric authentication.",
  "p-5-1-2": "Encrypted storage, which requires setting up additional PIN.",
  "p-5-1-3": "Fake PIN, to decrypt a decoy storage instead of the real one."
}
