{
  "step-0": "Intro",
  "step-1": "➀ Backup kata kunci rahasia",
  "step-2": "➁ Pakai watch-only wallet",
  "step-3": "➂ Pakai offline signer",
  "step-4": "Perawatan",
  "net-label": "Deteksi koneksi jaringan",
  "net-tip": "Apakah aplikasi akan memastikan jaringan tidak terhubung sebelum melakukan fungsi sensitif",
  "req-disconnect": "Silahkan putuskan sambungan Internet sebelum melanjutkan",
  "alert-1": "Passphrase PGP tidak cukup aman, silahkan mencoba kembali",
  "alert-2": "Passphrase Bitcoin tidak cukup aman, silahkan mencoba kembali",
  "alert-3": "Ini akan menimpa {{recFile}}. Apakah kamu yakin?",
  "alert-4": "File PGP terenkripsi telah berhasil dibuat",
  "alert-5": "Kunci-kunci rahasia Bitcoin berhasil dibaca dari isi file PGP",
  "alert-6": "Gagal membaca kunci-kunci rahasia Bitcoin dari file PGP",
  "sign-1": "transaksi tertulis ke",
  "sign-2": "transaksi telah ditandatangani! scan kode QR di watch-only wallet, atau simpan dalam bentuk file untuk lalu di-import",
  "sign-3": "Masukkan passphrase untuk membuka kunci file PGP",
  "sign-4": "Masukkan data PSBT (partially-signed bitcoin transaction) dari watch-only wallet",
  "sign-5": "Ulang Dari Awal",
  "sign-6": "Tandatangani Transaksi",
  "sign-7": "Simpan Sebagai File Transaksi",
  "sign-8": "Simpan Sebagai File PSBT",
  "sign-9": "Ini adalah versi teks dari kode QR di atas. Teks ini bisa ditempel di wallet yang mendukung import transaksi melalui clipboard.",
  "sign-10": "Jika scan kode QR gagal, pakai ini untuk menyimpan kode di atas ke file untuk diimport ke Bluewallet",
  "sign-11": "Ini untuk wallet yang hanya mendukung import/export file PSBT",
  "unlock-1": "Berhasil membuka enkripsi file PGP",
  "unlock-2": "Buka kunci file PGP kamu",
  "unlock-3": "Sepertinya kamu melewati langkah sebelumnya dan langsung masuk ke bagian ini. Oleh karena itu silahkan pastikan:",
  "unlock-4": "Proses backup recovery phrase sebelumnya telah dilakukan.",
  "unlock-5": "File PGP hasil backup berada di",
  "unlock-6": "Komputer tidak terhubung ke Internet.",
  "unlock-7": "Selanjutnya masukkan passphrase untuk membuka kunci backup recovery phrase",
  "unlock-8": "Buka kunci file PGP"
}
