{
  "title": "Menabung <1></1> secara aman",
  "p-0-1": "Aplikasi ini memberikan 3 langkah singkat agar kamu dapat menyimpan bitcoin secara mandiri dengan aman hingga bertahun-tahun. Tidak disarankan menyimpan tabungan bitcoin di broker/bursa kripto terpusat karena adanya risiko kebangkrutan, penipuan, dan peretasan, yang sebelumnya telah sering terjadi.",
  "p-0-2": "Software-software open source terbaik untuk Bitcoin lebih diperuntukkan bagi pengguna yang berpengalaman, sehingga banyak memiliki konsep dan pilihan yang sulit dimengerti pengguna awam. Di sisi lain, aplikasi yang ditujukan bagi pemula tidak cukup memberi penekanan dan bantuan dalam mengamankan kunci rahasia: sesuatu yang sangat penting karena self-custody berarti tidak ada pihak lain (seperti admin bank) yang akan dapat membantu proses pemulihan.",
  "p-0-3": "Aplikasi ini mengatasi masalah di atas dengan membekali kamu dengan pengetahuan yang cukup serta latihan praktis untuk dapat dengan yakin menyimpan bitcoin secara mandiri. Supaya tidak usang dan tetap relevan jauh ke depan, panduan ini telah mempertimbangkan dan mengadopsi prinsip-prinsip berikut ini:",
  "h-1": "Semakin mudah diikuti, semakin aman",
  "p-1-1": "Petunjuk sederhana yang mudah dimengerti dan diikuti secara konsisten oleh pengguna, akan mencapai hasil yang lebih baik ketimbang metode yang lebih kompleks. Karena itu panduan ini sengaja menghindari fitur-fitur dan istilah teknis yang tidak relevan dengan tujuan menabung Bitcoin.",
  "h-2": "Minimalkan ketergantungan terhadap pihak lain",
  "p-2-1": "Jaringan bitcoin dapat kita gunakan tanpa harus mempercayai, atau meminta izin pada, atau mengandalkan pihak lain. Tidak seperti aset lainnya, perantara antara kita dan jaringan Bitcoin hanya akan menimbulkan risiko pihak ketiga, yang dampak negatif dan kemungkinan terjadinya akan meningkat seiring waktu. Panduan ini dirancang untuk tidak mengandalkan fitur software, hardware, atau layanan tertentu, karena organisasi yang terbaik sekalipun bisa saja bermasalah di kemudian hari.",
  "p-2-2": "Prinsip ini juga menjadi alasan mengapa panduan ini hanya mencakup Bitcoin. Mata uang kripto lainnya memiliki jaringan yang jauh lebih kecil sehingga masa depannya meragukan, atau memiliki organisasi terpusat (yayasan, perusahaan, DAO, dlsb.) yang dapat melakukan perubahan besar terhadap sistem, sehingga membuat mereka lebih cocok sebagai investasi spekulatif yang memerlukan manajemen aktif ketimbang sarana menabung jangka panjang.",
  "h-3": "Ketahanan terhadap bencana besar",
  "p-3-1": "Rencana menabung jangka panjang harus mempertimbangkan risiko bencana berdampak besar, meskipun risiko tersebut kecil kemungkinan terjadinya dalam jangka pendek. Risiko dalam kategori ini termasuk kekerasan fisik/pemaksaan/penyitaan dari pihak yang berkuasa, kebangkrutan maupun penipuan oleh perusahaan penyedia jasa, pelaksanaan hukum yang tidak adil, kerusuhan, ataupun bencana alam.",
  "p-3-2": "Risiko bencana besar semacam di atas menggiring panduan ini ke arah alternatif-alternatif yang tidak mengandalkan keamanan fisik, atau mengasumsikan bahwa kondisi politik/finansial/alam saat ini akan selalu sama di masa mendatang."
}
