{
  "title": "Backup kunci rahasia <1></1>",
  "p-0-1": "Konfigurasi dompet Bitcoin memerlukan kunci rahasia  <1>recovery phrase</1> dan <3>passphrase</3>. Dompet menggunakan keduanya untuk membuat pasangan-pasangan kunci private dan public, yang masing-masingnya akan mengontrol akses ke alamat Bitcoin tertentu.",
  "p-0-2": "Bitcoin wallet yang baik akan menggunakan alamat berbeda, yang berarti pasangan kunci berbeda, untuk setiap transaksi baru. Mengingat kunci-kunci tersebut semuanya dapat diturunkan dari recovery phrase dan passphrase awal, maka pendekatan self-custody yang baik hanya perlu menjamin agar dua rahasia tersebut senantiasa selalu tersedia dan dapat diakses.",
  "p-0-3": "Meski begitu, sangat penting untuk memahami bahwa <1>jika kamu kehilangan salah satu rahasia tersebut, maka tidak ada yang akan dapat mengembalikan akses ke bitcoin kamu</1>. Karena itu pertama-tama di sini kita akan fokus untuk memastikan agar recovery phrase dan passphrase dapat tetap tersedia dan aman, tanpa perlu mengandalkan hardware/software/layanan berbayar dari pihak ketiga.",
  "h-1": "Unduh dan pasang GnuPG di komputer",
  "p-1-1": "Kita akan memakai GnuPG untuk menyimpan recovery phrase dan passphrase Bitcoin dalam file terenkripsi, agar keduanya dapat disimpan dengan aman di cloud.",
  "p-1-2": "Penggunaan protokol enkripsi yang matang dan memiliki dukungan software luas sangatlah penting untuk mendapatkan proteksi jangka panjang. PGP (Pretty Good Privacy) adalah protokol semacam itu, dan GnuPG adalah software open source ternama yang mengimplementasikan PGP. Versi terkini GnuPG dapat diunduh dari <1>sini</1>.",
  "h-2": "Pakai sistem yang (relatif) aman dan bersih",
  "p-2-1": "Putuskan semua koneksi jaringan, dan jalankan scan anti-malware secara menyeluruh. Pastikan kamu hanya melanjutkan di sistem yang aman dan bersih dari virus. <1>Jangan</1> hubungkan kembali koneksi jaringan sebelum diinstruksikan secara eksplisit kemudian.",
  "h-3": "Buat kunci-kunci rahasia Bitcoin",
  "p-3-1": "Masukkan recovery phrase (terdiri dari 12 atau 24 kata) yang kamu miliki saat ini, atau buat yang baru dengan tombol di bawah. <1>Sangat direkomendasikan</1> untuk membuat baru jika kamu ragu apakah selama ini recovery phrase yang lama telah ditangani secara aman di masa lalu.",
  "p-3-2": "Kondisi yang layak menimbulkan keraguan antara lain meliputi jika recovery phrase lama tersebut pernah disalin/simpan ke banyak tempat, atau jika penyimpanan di salah satu tempat tersebut tidak dalam bentuk terenkripsi, atau jika recovery phrase pernah dipasang ke aplikasi wallet yang bukan open source, atau jika wallet lama dibuat tanpa menggunakan passphrase tambahan. Dalam semua kasus tersebut, lebih baik memulai ulang dari awal dan pindahkan dana dari wallet lama ke wallet baru setelahnya.",
  "p-3-2-1": "Masukkan recovery phrase lama atau klik tombol untuk membuat baru ...",
  "p-3-2-2": "Buat Recovery Phrase Bitcoin",
  "p-3-2-3": "Selanjutnya, masukkan atau buat passphrase yang akan berpasangan dengan recovery phrase. Ketahui bahwa selanjutnya ini <strong> tidak bisa diubah</strong>, dan kamu akan perlu mengetikkan passphrase ini setiap kali melakukan transaksi Bitcoin. Oleh karena itu demi alasan praktis (namun tetap menjaga keamanan), passphrase ini sebaiknya hanya berisi 10-15 karakter dan harus cukup mudah untuk diketik dan pada akhirnya diingat.",
  "p-3-2-4": "Masukkan passphrase Bitcoin atau klik tombol untuk membuat baru ...",
  "p-3-2-5": "Buat Baru Passphrase Bitcoin",
  "h-4": "Backup kunci-kunci rahasia ke file terenkripsi PGP",
  "p-4-1": "Selanjutkan kita akan menyimpan kunci-kunci rahasia tersebut ke dalam file terenkripsi PGP, agar dapat disimpan dengan aman di berbagai lokasi. Masukkan atau buat secara otomatis passphrase yang akan dipakai untuk membuka/tutup enkripsi PGP file di bawah ini. Ketahui bahwa kamu tidak akan perlu sering membuka kunci ini dan hanya akan melakukan hal tersebut di komputer yang diketahui aman, sehingga di sini disarankan untuk memakai passphrase yang lebih kuat dibanding passphrase Bitcoin sebelumnya.",
  "p-4-1-1": "Masukkan passphrase PGP atau klik tombol untuk membuat baru ...",
  "p-4-1-2": "Buat Passphrase PGP",
  "p-4-2": "Pakai tombol berikut untuk membuat file backup PGP (<1>recovery.txt.gpg</1>) di dalam direktori home kamu.",
  "p-4-2-1": "<1>PERINGATAN</1>: operasi ini akan menimpa file yang telah ada di ",
  "p-4-2-2": "Backup Kunci-Kunci Rahasia Bitcoin",
  "h-5": "Pastikan bahwa backup bekerja sebagaimana mestinya",
  "p-5-1": "Tombol berikut akan mencoba membuka enkripsi file PGP dengan memanfaatkan passphrase di atas, lalu memastikan bahwa di dalamnya terdapat kunci-kunci rahasia Bitcoin yang sesuai.",
  "p-5-1-1": "Verifikasi Proses Dekripsi",
  "p-5-2": "Sekarang coba lakukan proses dekripsi file PGP (<1>recovery.txt.gpg</1>) secara manual dengan software GnuPG. Klik tombol berikut untuk menemukan lokasi file, lalu buka file tersebut dengan aplikasi Kleopatra (aplikasi desktop GnuPG) dan passphrase PGP yang sesuai. Pastikan bahwa di dalam terdapat file recovery.txt, dan file tersebut berisi kunci-kunci rahasia Bitcoin dibatasi dengan karakter",
  "p-5-2-1": "Buka Lokasi File PGP",
  "h-6": "Backup passphrase PGP",
  "p-6-1": "Tulis passphrase PGP pada 2 lembar kertas atau lebih. Jangan tambahkan informasi atau catatan agar orang lain tidak tahu fungsi dari passphrase tersebut. Sebar kertas-kertas tersebut di beberapa lokasi yang aman. Jika kamu memakai software password manager, maka masukkan juga passphrase PGP ini ke dalamnya.",
  "p-6-2": "Perlu diketahui bahwa recovery phrase Bitcoin memiliki karakteristik yang diketahui oleh umum, seperti terdiri dari 12 atau 24 kata, dan masing-masing kata tersebut berasal dari daftar yang berisikan 2048 kata. Oleh karena itu tidak disarankan melakukan backup recovery phrase Bitcoin dengan cara menuliskannya di kertas (atau lempengan metal sekalipun) dan coba menyimpannya di lokasi yang dianggap aman.",
  "p-6-3": "Di sisi lain, passphrase PGP tidak harus mengikuti pola tertentu dan karenanya bisa dituliskan di kertas selama tidak ada petunjuk tentang konteks pemakaiannya.",
  "p-6-4": "Konfirmasikan bahwa kamu telah menulis passphrase PGP di kertas dan mengamankannya dengan menekan tombol berikut. Ini akan menghapus kunci-kunci rahasia dari area input di atas.",
  "p-6-4-1": "Konfirmasikan Bahwa Passphrase PGP telah Dibackup",
  "h-7": "Salin file PGP ke beberapa lokasi",
  "p-7-1": "Hubungkan kembali komputer ke Internet. Salin file <1>recovery.txt.gpg</1> ke dua atau lebih penyedia jasa penyimpanan cloud ternama (seperti Google drive, Microsoft OneDrive, Apple iCloud Drive, Dropbox). Pastikan kamu mengaktifkan proteksi otentikasi multi faktor di masing-masing layanan tersebut.",
  "p-7-2": "Salin juga file PGP ke satu atau lebih flash disk USB. Ini akan menjadi backup terhadap akses kamu ke penyimpanan cloud, dan flash disk USB ini harus disimpan terpisah secara fisik dari lembaran kertas passphrase PGP sebelumnya."
}
