{
  "title": "Gunakan offline signer untuk bertransaksi",
  "p-0-1": "Self-custody secara aman berarti mengurangi jumlah lokasi yang dapat mengakses private keys, sehingga permukaan yang mungkin bocor menjadi jauh lebih kecil. Dan karena private keys selalu dapat dibuat ulang dengan kunci rahasia Bitcoin, idealnya kamu hanya memerlukan satu saja lokasi penyimpanan private keys.",
  "p-0-2": "<1>Offline signer</1> adalah perangkat yang tidak terhubung ke jaringan, dan difungsikan sebagai jembatan untuk mengakses private keys Bitcoin secara aman. Risiko keamanan bertransaksi Bitcoin akan turun drastis dengan pemakaian offline signer sebagai satu-satunya perangkat yang memiliki akses langsung ke private keys.",
  "p-0-3": "Offline signer berkomunikasi dengan watch-only wallet melalui jalur fisik, baik melalui transfer file lewat USB flash disk ataupun scan kode QR, untuk dapat menandatangani transaksi yang dibuat oleh wallet. Konfigurasi demikian umum disebut sebagai <1>cold wallet</1>, dan seringkali melibatkan pemakaian hardware khusus sebagai perangkat offline signer.",
  "p-0-4": "Selanjutnya akan kita pelajari bagaimana menggunakan offline signer berbasis software untuk mengirimkan koin dari Bluewallet ke akun kamu di broker/bursa.",
  "h-1": "Dapatkan alamat deposit Bitcoin di broker/bursa",
  "p-1-1": "Gunakan sistem panduan broker/bursa untuk mencari tahu bagaimana cara melakukan deposit bitcoin atau BTC ke akun kamu melalui jaringan Bitcoin Mainnet (Segwit). Salin alamat deposit tersebut untuk dipakai pada langkah selanjutnya.",
  "h-2": "Lakukan transaksi pengiriman di Bluewallet",
  "p-2-1": "Coba lakukan transaksi pengiriman dari watch-only wallet ke alamat deposit broker/bursa. Karena watch-only wallet tidak memiliki akses ke private key, Bluewallet akan memberikan beberapa opsi untuk menandatangani transaksi dengan offline signer",
  "h-3": "Pindahkan transaksi yang belum selesai tersebut ke offline signer",
  "p-3-1": "Untuk saat ini, pilih saja opsi \"Copy to clipboard\" di Bluewallet, lalu kirim transaksi yang belum selesai tersebut ke komputer melalui WhatsApp web, atau metode transfer lainnya. Dalam kondisi sesungguhnya, transfer data bisa dilakukan melalui scan kode QR (yang membutuhkan kamera di komputer), atau media penyimpanan fisik macam USB flash disk.",
  "p-3-2": "Tempelkan teks tersebut pada area di bawah, putuskan hubungan jaringan komputer untuk mensimulasikan offline signer, lalu klik tombol untuk coba menandatangani transaksi.",
  "h-4": "Selesaikan transaksi di Bluewallet",
  "p-4-1": "Kode QR di atas berisi transaksi yang telah ditandatangani dan dinyatakan final. Scan kode tersebut di Bluewallet, atau import data yang sama melalui file, kemudian konfirmasikan bahwa kamu bersedia jika transaksi tersebut disiarkan/dikirimkan ke jaringan Bitcoin. Setelah itu biasanya saldo kamu di broker/bursa akan bertambah dalam beberapa menit kemudian.",
  "p-4-2": "Selanjutnya kamu bisa mengulangi langkah-langkah di atas untuk mengirim koin secara aman dari Bluewallet ke alamat Bitcoin lainnya. Jika HP kamu di-hack atau diambil orang, dana kamu akan tetap aman karena Bluewallet tidak bisa melakukan transaksi tanpa bantuan dari luar. Dalam kondisi tersebut, kamu hanya perlu memasang ulang Bluewallet di HP lain, dan menambahkan watch-only wallet sebagaimana dibahas pada bagian sebelumnya.",
  "h-5": "Evaluasi, dapatkan, dan siapkan offline signer",
  "p-5-1": "Kini setelah kamu mengerti tujuan dari offline signer (cold wallet) dan bagaimana cara kerjanya, kamu dapat mulai mengevaluasi opsi yang tersedia untuk pemakaian di masa mendatang. Kategori umum antara lain adalah:",
  "p-5-2": "Hardware wallet",
  "p-5-3": "Produk open source khusus Bitcoin seperti <1>Coldcard</1> adalah yang terbaik dari sisi keamanan. Mendukung hanya satu jenis kripto saja (Bitcoin) akan membuat sistem jadi lebih sederhana dan tim menjadi lebih fokus. Hal ini juga mengisyaratkan bahwa tim lebih peduli terhadap keamanan ketimbang pangsa pasar. Perlu diketahui pula bahwa meskipun hanya mendukung Bitcoin, Coldcard bisa dipakai untuk menurunkan dan mengamankan ribuan recovery phrase yang semuanya dapat dipakai pada wallet crypto lainnya.",
  "p-5-4": "Sofware wallet (terpasang di komputer)",
  "p-5-5": "Ini biasanya merupakan wallet yang memiliki banyak fitur sehingga sulit untuk diperuntukkan hanya sebagai offline signer oleh pengguna umum.",
  "p-5-6": "Tapi jika ini adalah opsi satu-satunya untuk kamu saat ini, kamu bisa saja menggunakan Shiro sebagai offline signer sementara sebelum mendapatkan solusi yang lebih permanen. Shiro memiliki mode khusus untuk keperluan tersebut dan dapat diaktifkan dengan memberikan <1>--signer</1> sebagai parameter eksekusi awalnya. Sebagai contoh di Windows:",
  "p-5-7": "Untuk pengguna MacOS, Bluewallet memiliki versi desktop yang juga dapat digunakan sebagai offline signer.",
  "p-5-8": "Sofware wallet (terpasang di HP lama)",
  "p-5-9": "Ini merupakan alternatif bagus jika kamu memiliki HP lama yang tidak lagi aktif dipakai. Yang perlu dilakukan hanyalah me-reset perangkat tersebut, memasang aplikasi cold wallet seperti misalnya <1>AirGap Vault</1>, memasukkan recovery phrase and passphrase Bitcoin ke dalamnya, lalu memutuskan hubungan jaringan ke perangkat tersebut. Pastikan juga untuk mengatur password boot, penguncian layar, dan pilihan-pilihan keamanan fisik lainnya.",
  "p-5-10": "Solusi apapun yang pada akhirnya kamu pilih, coba untuk hanya memakai fitur umum yang juga tersedia di perangkat open source populer seperti fitur offline signer, agar kamu dapat berpindah ke perangkat lain dengan mudah jika diperlukan."
}
